# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialTypeSet..::..Insert Method
WireMaterialTypeSet Class See Also
---
Insert the specified wire material type into the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	WireMaterialType item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As WireMaterialType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	WireMaterialType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireMaterialTypeThe wire material type to be inserted into the set.
# ### Return Value
Returns whether the wire material type was inserted into the set.
# See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace